Revit 2027 API
AdaptiveComponentFamilyUtils.IsAdaptiveComponentFamily Method
 Verifies if the Family is an Adaptive Component Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsAdaptiveComponentFamily(
	Family family
)
Public Shared Function IsAdaptiveComponentFamily (
	family As Family
) As Boolean
public:
static bool IsAdaptiveComponentFamily(
	Family^ family
)
static member IsAdaptiveComponentFamily :
        family : Family -> bool
Parameters
family Family
 The Family
Return Value
Boolean
 True if the Family is an Adaptive Component Family.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace